slides_oop.md
```plantuml
@startuml
scale 2
hide empty member

interface Iterable
interface Collection
interface List
abstract AbstractCollection
abstract AbstractList
class ArrayList

Iterable <|-- Collection
Collection <|-- List
List <|.. AbstractList
Collection <|.. AbstractCollection
AbstractCollection <|-- AbstractList
AbstractList <|-- ArrayList
@enduml
```
