slides_oop.md
```plantuml
@startuml
scale 2
hide empty member

class ArrayList
interface List
interface MutableList
interface MutableCollection
interface Iterable
interface MutableIterable
interface Collection
abstract AbstractCollection
abstract AbstractMutableCollection

Iterable <|-- MutableIterable
Iterable <|-- Collection
MutableIterable <|-- MutableCollection
Collection <|.. AbstractCollection
Collection <|-- MutableCollection
Collection <|-- List
AbstractCollection <|-- AbstractMutableCollection
MutableCollection <|.. AbstractMutableCollection
AbstractMutableCollection <|- ArrayList
MutableCollection <|-- MutableList
List <|-- MutableList
MutableList <|.. ArrayList
@enduml
```
