slides_oop.md
```plantuml
@startuml
scale 2
hide members
hide circles

class Controller
class BusinessLogic
class Database
class Presenter

Controller -> BusinessLogic
BusinessLogic --> Database
BusinessLogic -> Presenter
@enduml
```
