slides_oop.md
```plantuml
@startuml
scale 1.5
hide members
hide class circles

class Controller
class BusinessLogic
class Database
class Presenter

interface InputBoundary
interface OutputBoundary
interface DataAccessInterface

Controller -> InputBoundary
InputBoundary <|.. BusinessLogic
BusinessLogic -> OutputBoundary
OutputBoundary <|.. Presenter
BusinessLogic --> DataAccessInterface
DataAccessInterface <|.. Database
@enduml
```
